---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotSwapNestedGroups
source: html/ccefd0e2-2ac8-faf0-454e-93e5eae764bc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotSwapNestedGroups Property

Can't replace because one Group is contained in the other.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSwapNestedGroups { get; }
```